Функция ПолучитьДанныеНоменклатуры() Экспорт
	
	Запрос = Новый Запрос;
	
	// Характеристики номенклатуры
	Запрос.Текст =  
	"ВЫБРАТЬ 
	| ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
	| ХарактеристикиНоменклатуры.Владелец КАК Владелец_ВК,
	| ХарактеристикиНоменклатуры.Наименование КАК Наименование,
	| ХарактеристикиНоменклатуры.НаименованиеПолное КАК НаименованиеПолное
	|ИЗ 
	|   Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры";
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	МассивХарактеристикиНоменклатуры = Новый Массив;
	Пока Выборка.Следующий()Цикл
		ХарактеристикаНоменклатуры = Новый Структура;
		ХарактеристикаНоменклатуры.Вставить("external_id", "" + Выборка.Ссылка.УникальныйИдентификатор());
		ХарактеристикаНоменклатуры.Вставить("external_product_id", "" + Выборка.Владелец_ВК.УникальныйИдентификатор());
		ХарактеристикаНоменклатуры.Вставить("title", Выборка.Наименование);
		ХарактеристикаНоменклатуры.Вставить("description", Выборка.НаименованиеПолное);
		МассивХарактеристикиНоменклатуры.Добавить(ХарактеристикаНоменклатуры);
	КонецЦикла;
	
	// Виды номенклатуры
	Запрос.Текст = 
	"ВЫБРАТЬ 
	| ВидыНоменклатуры.Ссылка КАК Ссылка,
	| ВидыНоменклатуры.Наименование КАК Наименование
	|ИЗ 
	|   Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры";

	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВидыНоменклатуры = Новый Массив;
	Пока Выборка.Следующий()Цикл
		ВидНоменклатуры = Новый Структура;
		ВидНоменклатуры.Вставить("external_id", "" + Выборка.Ссылка.УникальныйИдентификатор());
		ВидНоменклатуры.Вставить("name", Выборка.Наименование);
		МассивВидыНоменклатуры.Добавить(ВидНоменклатуры);
	КонецЦикла;
	
	// Марки (бренды)
	Запрос.Текст = 
	"ВЫБРАТЬ 
	| Марки.Ссылка КАК Ссылка,
	| Марки.Наименование КАК Наименование,
	| Марки.Производитель КАК Производитель
	|ИЗ 
	|   Справочник.Марки КАК Марки";

	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивМарки = Новый Массив;
	Пока Выборка.Следующий()Цикл
		Марка = Новый Структура;
		Марка.Вставить("external_id", "" + Выборка.Ссылка.УникальныйИдентификатор());
		Марка.Вставить("name", Выборка.Наименование);
		Марка.Вставить("manufacturer", "" + Выборка.Производитель);
		МассивМарки.Добавить(Марка);
	КонецЦикла;
	
	// Товары из номенклатуры
	Запрос.Текст = 
	"ВЫБРАТЬ 
	| Номенклатура.Ссылка КАК Ссылка,
	| Номенклатура.Наименование КАК Наименование,
	| Номенклатура.Артикул КАК Артикул,
	| Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры_ВК,
	| Номенклатура.Марка КАК Марка_ВК
	|ИЗ 
	| Справочник.Номенклатура КАК Номенклатура";

	Выборка = Запрос.Выполнить().Выбрать();
	МассивТовары = Новый Массив;
	Пока Выборка.Следующий() Цикл  
		Товар = Новый Структура;
		Товар.Вставить("external_id", "" + Выборка.Ссылка.УникальныйИдентификатор());
		Товар.Вставить("name", Выборка.Наименование);
		
		Артикул = Выборка.Артикул;
		Товар.Вставить("vendor_code", ?(ЗначениеЗаполнено(Артикул) И Артикул <> Null, Артикул, ""));
		
		Товар.Вставить("price", 5);
		
		// Картинки из присоединенных файлов номенклатуры
		Запрос.Текст = 
		"ВЫБРАТЬ 
		| НоменклатураПрисоединенныеФайлы.Ссылка КАК ФайлКартинки,
		| НоменклатураПрисоединенныеФайлы.Расширение КАК ФорматФайлаКартинки
		|ИЗ 
		| Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
		|ГДЕ
		| НоменклатураПрисоединенныеФайлы.ВладелецФайла = &ВладелецСсылка";
		Запрос.УстановитьПараметр("ВладелецСсылка", Выборка.Ссылка);
		
		ВыборкаКартинки = Запрос.Выполнить().Выбрать();
		
		МассивКартинки = Новый Массив;
		Пока ВыборкаКартинки.Следующий() Цикл
			Картинка = Новый Структура;
			ФорматФайлаКартинки = ВыборкаКартинки.ФорматФайлаКартинки;
			ФайлКартинки = ВыборкаКартинки.ФайлКартинки;
			Картинка.Вставить("format", ?(ЗначениеЗаполнено(ФорматФайлаКартинки) И ФорматФайлаКартинки <> Null, ФорматФайлаКартинки, ""));
			Картинка.Вставить("base64", ?(ЗначениеЗаполнено(ФайлКартинки) И ФайлКартинки <> Null, ПолучитьКартинку(ФайлКартинки), ""));
			МассивКартинки.Добавить(Картинка);
		КонецЦикла;
		Товар.Вставить("img", МассивКартинки);
		
		ВидНоменклатуры_ВК = Выборка.ВидНоменклатуры_ВК;
		Товар.Вставить("external_type_id", ?(ЗначениеЗаполнено(ВидНоменклатуры_ВК) И ВидНоменклатуры_ВК <> Null, "" + ВидНоменклатуры_ВК.УникальныйИдентификатор(), ""));
		
		Марка_ВК = Выборка.Марка_ВК;
		Товар.Вставить("external_brand_id", ?(ЗначениеЗаполнено(Марка_ВК) И Марка_ВК <> Null, "" + Марка_ВК.УникальныйИдентификатор(), ""));
		
		МассивТовары.Добавить(Товар);
	КонецЦикла;

	КорневойОбъект = Новый Структура;
	КорневойОбъект.Вставить("product_characteristic", МассивХарактеристикиНоменклатуры);
	КорневойОбъект.Вставить("product_type", МассивВидыНоменклатуры); 
	КорневойОбъект.Вставить("product_brand", МассивМарки);
	КорневойОбъект.Вставить("product", МассивТовары);
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, КорневойОбъект);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

&НаСервере
Функция ПолучитьКартинку(СсылкаНаФайл)
	
	Если ЗначениеЗаполнено(СсылкаНаФайл) Тогда
    	 ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(СсылкаНаФайл);
    	 Возврат Base64Строка(ДвоичныеДанные);   	
	КонецЕсли;
	 
КонецФункции