Функция ПолучитьДанныеНоменклатуры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ 
	| ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
	| ХарактеристикиНоменклатуры.Владелец КАК Владелец,
	| ХарактеристикиНоменклатуры.Наименование КАК Наименование,
	| ХарактеристикиНоменклатуры.НаименованиеПолное КАК НаименованиеПолное
	|ИЗ 
	|   Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры";
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	МассивХарактеристикиНоменклатуры = Новый Массив;
	Пока Выборка.Следующий()Цикл
		ХарактеристикаНоменклатуры = Новый Структура;
		ХарактеристикаНоменклатуры.Вставить("external_id", "" + Выборка.Ссылка.УникальныйИдентификатор());
		ХарактеристикаНоменклатуры.Вставить("product_id", "" + Выборка.Владелец. УникальныйИдентификатор());
		ХарактеристикаНоменклатуры.Вставить("title", Выборка.Наименование);
		ХарактеристикаНоменклатуры.Вставить("description", Выборка.НаименованиеПолное);
		МассивХарактеристикиНоменклатуры.Добавить(ХарактеристикаНоменклатуры);
	КонецЦикла;
	
	ОбъектХарактеристикиНоменклатуры = Новый Структура;
	ОбъектХарактеристикиНоменклатуры.Вставить("product_characteristic", МассивХарактеристикиНоменклатуры);
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ОбъектХарактеристикиНоменклатуры);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции